package com.company.JavaCore.Level_7.Synchronized;

public class Theory {
    /*
    Synchronized позволяет настроить взаимодействие потоков между собой
    Потоки могут совершать одновременно какие-то действия над 1 объектом
    И не знать об этом
    Это приводит к некорректному взаимодействию потоков между собой
    Есть спец понятие мьютекс - взаимное исключение
    Задача мьютекса - обеспечить доступ к объекту только 1 потоку
    Если 1 поток работает с объектом, другой поток будет ждать своей очереди
     */
}
