package com.Steams;

public class Steams {
    /*
    Потоки делятся по направлению:
    - поток ввода;
    - поток вывода.
    По типу данных, с которыми работают:
    - байты;
    - символы.

    Поток ввода - InputStream - работает с байтами
    Поток вывода - OutputStream - работает с байтами
    Поток ввода - Reader - работает с символами
    Поток вывода - Writer - работает с символами

    Если объект реализует интерфейс InputStream, значит он поддерживает
    последовательное чтение из него (объекта) байтов
    Если объект реализует интерфейс OutputStream, значит он поддерживает
    последовательную запись в него байтов
    Если объект реализует интерфейс Reader, значит он поддерживает
    последовательное чтение из него (объекта) символов - char
    Если объект реализует интерфейс Writer, значит он поддерживает
    последовательною запись в него символов - char

     */
}
