package com.company.JavaCore;

public class OOP {
    /*
    Основы ООП
    4 принципа ООП:
    1. Абстракция
    2. Инкапсуляция
    3. Наследование
    4. Полиморфизм

    Абстракция - разбиение чего-то сложного и монолитного на маленькие
    составные части. Например, класс Numbers, от которого наследуются Integer, Double и т.д.

    Инкапсуляция. Основная цель сделать программу как можно проще.
    А как ее можно упростить? Скрыть от посторонних глаз сложные части.
    Инкапсуляция - это сокрытие реализации.

    Наследование. Один класс может наследовать методы и параметры другого класса.

    Полиморфизм позволяет единообразно обращаться к объектам различных классов.
    Это способность использовать методы производного класса.
    Класс шаблон
    Принцип в ООП, когда программа может использовать объекты с одинаковым
    интерфейсом без информации о внутреннем устройстве объекта, называется полиморфизмом.
     */
}
