package com.company.JavaCore.Level_8.Wrapper;

public class Wrapper {
/*

Паттерн проектирования "Обертка" (Wrapper or Decorator) - это
механизм расширения функциональности объектов
Обертка закрывает доступ к оригинальному объекту, оборачивая его

Если мы хотим обернуть методы какого-то объекта своим кодом, нам нужно:
1) Создать свой класс обертку и унаследоваться от класса, инерфейса,
для которого делаем обертку
2) Передать оборачиваемый объект в конструктор нашего класса
3) Переопределить все методы в нашем классе-обертке и вызвать
в них методы оборачиваемого объекта
4) Внести свои изменения

Класс - обертка (Wrapper) не хранит никакие данные, кроме ссылки
на сам объект
 */
}
